app/controllers/favorites_controller.rb

    def index
        favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

    def create
        new_favorite = Favorite.create(favorites_params)
---
INSERT INTO "favorites" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["restaurant_id", "ChIJvUKiavpzxokRa6FSEChrl84"], ["created_at", "2019-12-04 22:09:44.429624"], ["updated_at", "2019-12-04 22:09:44.429624"]]