app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
    def show
        render json: Review.find(params['id']).to_json(reviews_serializer)

INSERT INTO "reviews" ("comment", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "kill me"], ["user_id", 1], ["restaurant_id", "ChIJvUKiavpzxokRa6FSEChrl84"], ["created_at", "2019-12-04 21:02:19.500587"], ["updated_at", "2019-12-04 21:02:19.500587"]]
---
    def create
        new_review = Review.create(reviews_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def destroy
        render json: Review.find(params['id']).to_json(reviews_serializer)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "hello"], ["updated_at", "2019-12-05 15:54:24.743530"], ["id", 8]]
---
    def update
        review = Review.find(params['id']).update(reviews_params)