app/controllers/sessions_controller.rb

    def create
      @user = User.find_by(email: session_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "alec@alec.com"], ["LIMIT", 1]]